Name: Kagen Lim

Completed as HW02 of QMSS-G5072, Modern Data Structures, Fall 2020.

Contact: [kagen.lim@columbia.edu](kagen.lim@columbia.edu)

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
peaks = pd.read_csv('data/peaks.csv')
expeditions = pd.read_csv('data/expeditions.csv')
members = pd.read_csv('data/members.csv')

# Question 1: Peaks

## Answer the following questions using the `peaks` data only:

### What proportion of peaks is still unclimbed?

In [2]:
#number of unclimbed peaks
no_unclimbed_peaks = (peaks['climbing_status'] == 'Unclimbed').value_counts().loc[True]
print(no_unclimbed_peaks)

#total number of peaks
total_no_peaks = peaks['climbing_status'].count()
print(total_no_peaks)

#proportion of unclimbed peaks
print(no_unclimbed_peaks/total_no_peaks)

127
468
0.27136752136752135

### What is the average height of the climbed peaks vs. unclimbed peaks?

In [3]:
#table which shows average height of climbed peaks vs unclimbed peaks
print(peaks[['climbing_status','height_metres']].groupby('climbing_status').agg('mean'))

                 height_metres
climbing_status
Climbed            6706.284457
Unclimbed          6523.330709

# Question 2: Sherpas

## Using the `members` data only, select a subset of all persons who have a Nepalese `citizenship`.

In [4]:
nepalese = members[members['citizenship'] == 'Nepal']
nepalese.head()

,expedition_id,member_id,peak_id,peak_name,year,season,sex,age,citizenship,expedition_role,...,highpoint_metres,success,solo,oxygen_used,died,death_cause,death_height_metres,injured,injury_type,injury_height_metres
24,AMAD79101,AMAD79101-18,AMAD,Ama Dablam,1979,Spring,M,23.0,Nepal,H-A Worker,...,6814.0,True,False,False,False,NaN,NaN,False,NaN,NaN
48,AMAD79301,AMAD79301-26,AMAD,Ama Dablam,1979,Autumn,M,NaN,Nepal,H-A Worker,...,6814.0,True,False,False,False,NaN,NaN,False,NaN,NaN
49,AMAD79301,AMAD79301-24,AMAD,Ama Dablam,1979,Autumn,M,NaN,Nepal,H-A Worker,...,6814.0,True,False,False,False,NaN,NaN,False,NaN,NaN
50,AMAD79301,AMAD79301-25,AMAD,Ama Dablam,1979,Autumn,M,NaN,Nepal,H-A Worker,...,6814.0,True,False,False,False,NaN,NaN,False,NaN,NaN
82,AMAD81101,AMAD81101-11,AMAD,Ama Dablam,1981,Spring,M,25.0,Nepal,H-A Worker,...,6814.0,True,False,False,False,NaN,NaN,False,NaN,NaN

### a) What proportion of them was hired for the expedition?

In [5]:
print(nepalese.loc[nepalese['hired'] == True, 'hired'].count())

print(len(nepalese))

15071
16135

### b) What are their minimum, maximum, and average ages?

In [6]:
nepalese[['age']].agg(['min', 'max', 'mean'])

            age
min   12.000000
max   85.000000
mean  32.885062

# Question 3: Gender

## Now use all three data sets and join them on the provided ID variables. For this question, limit yourself to the subset of non-`hired` participants.

In [7]:
all_three = members.merge(peaks,how='inner', on = 'peak_id').merge(expeditions, how='inner', on='expedition_id')

In [8]:
non_hired_all = all_three.loc[all_three['hired'] == False, :]
print(non_hired_all.head())
print(list(non_hired_all.columns))

  expedition_id     member_id peak_id_x peak_name_x  year_x season_x sex  \
0     AMAD78301  AMAD78301-01      AMAD  Ama Dablam    1978   Autumn   M
1     AMAD78301  AMAD78301-02      AMAD  Ama Dablam    1978   Autumn   M
2     AMAD78301  AMAD78301-03      AMAD  Ama Dablam    1978   Autumn   M
3     AMAD78301  AMAD78301-04      AMAD  Ama Dablam    1978   Autumn   M
4     AMAD78301  AMAD78301-05      AMAD  Ama Dablam    1978   Autumn   M

    age citizenship expedition_role  ...  highpoint_date  termination_date  \
0  40.0      France          Leader  ...      1978-10-20        1978-10-23
1  41.0      France   Deputy Leader  ...      1978-10-20        1978-10-23
2  27.0      France         Climber  ...      1978-10-20        1978-10-23
3  40.0      France      Exp Doctor  ...      1978-10-20        1978-10-23
4  34.0      France         Climber  ...      1978-10-20        1978-10-23

                                  termination_reason  highpoint_metres_y  \
0  Bad conditions (deep snow, avalanching, fallin...              6000.0
1  Bad conditions (deep snow, avalanching, fallin...              6000.0
2  Bad conditions (deep snow, avalanching, fallin...              6000.0
3  Bad conditions (deep snow, avalanching, fallin...              6000.0
4  Bad conditions (deep snow, avalanching, fallin...              6000.0

   members  member_deaths hired_staff  hired_staff_deaths  oxygen_used_y  \
0        8              0           5                   0          False
1        8              0           5                   0          False
2        8              0           5                   0          False
3        8              0           5                   0          False
4        8              0           5                   0          False

  trekking_agency
0             NaN
1             NaN
2             NaN
3             NaN
4             NaN

[5 rows x 43 columns]
['expedition_id', 'member_id', 'peak_id_x', 'peak_name_x', 'year_x', 'season_x', 'sex', 'age', 'citizenship', 'expedition_role', 'hired', 'highpoint_metres_x', 'success', 'solo', 'oxygen_used_x', 'died', 'death_cause', 'death_height_metres', 'injured', 'injury_type', 'injury_height_metres', 'peak_name_y', 'peak_alternative_name', 'height_metres', 'climbing_status', 'first_ascent_year', 'first_ascent_country', 'first_ascent_expedition_id', 'peak_id_y', 'peak_name', 'year_y', 'season_y', 'basecamp_date', 'highpoint_date', 'termination_date', 'termination_reason', 'highpoint_metres_y', 'members', 'member_deaths', 'hired_staff', 'hired_staff_deaths', 'oxygen_used_y', 'trekking_agency']

### a) What is the first record of a woman summitting a peak? Which peak (name and height in meters) was that?

In [9]:
#first record of woman, TENG49101-03, summitting a peak within this dataset.
first_woman = non_hired_all.query('sex == "F" & success == True').sort_values(by='highpoint_date').head(1)
first_woman

,expedition_id,member_id,peak_id_x,peak_name_x,year_x,season_x,sex,age,citizenship,expedition_role,...,highpoint_date,termination_date,termination_reason,highpoint_metres_y,members,member_deaths,hired_staff,hired_staff_deaths,oxygen_used_y,trekking_agency
73087,TENG49101,TENG49101-03,TENG,Tengkoma,1949,Spring,F,NaN,Switzerland,Climber,...,1949-06-17,1949-07-18,Success (main peak),6215.0,5,0,1,0,False,NaN

In [10]:
#peak(name) and height in metres that first woman summitted, within this dataset.
print(first_woman[['peak_name_x', 'height_metres']])

      peak_name_x  height_metres
73087    Tengkoma           6215

### b) Provide a single cross-tab table of the `sex` of an expedition participant and 
- the proportion of `success` in summitting a main peak or sub-peak
- the proportion of participants using `oxygen` support 
- the proportion of participants who died.

In [11]:
success = non_hired_all.success
oxygen = non_hired_all.oxygen_used_x
died = non_hired_all.died

pd.crosstab(index = non_hired_all.sex, columns = [success, oxygen, died], margins = True)

success        False                   True                    All
oxygen_used_x  False       True       False       True
died           False True False True  False True False True
sex
F               4336   27   351    8   1129    7  1147    7   7012
M              33768  466  2647   78  10010  117  6604   78  53768
All            38104  493  2998   86  11139  124  7751   85  60780

# Question 4: Accidents

## For this question, use the `expeditions` data only.

In [16]:
print(expeditions.head())
print(list(expeditions.columns))
print(expeditions.year.min())
print(expeditions.year.max())

  expedition_id peak_id     peak_name  year  season basecamp_date  \
0     ANN260101    ANN2  Annapurna II  1960  Spring    1960-03-15
1     ANN269301    ANN2  Annapurna II  1969  Autumn    1969-09-25
2     ANN273101    ANN2  Annapurna II  1973  Spring    1973-03-16
3     ANN278301    ANN2  Annapurna II  1978  Autumn    1978-09-08
4     ANN279301    ANN2  Annapurna II  1979  Autumn           NaN

  highpoint_date termination_date                termination_reason  \
0     1960-05-17              NaN               Success (main peak)
1     1969-10-22       1969-10-26               Success (main peak)
2     1973-05-06              NaN               Success (main peak)
3     1978-10-02       1978-10-05  Bad weather (storms, high winds)
4     1979-10-18       1979-10-20  Bad weather (storms, high winds)

   highpoint_metres  members  member_deaths  hired_staff  hired_staff_deaths  \
0            7937.0       10              0            9                   0
1            7937.0       10              0            0                   0
2            7937.0        6              0            8                   0
3            7000.0        2              0            0                   0
4            7160.0        3              0            0                   0

   oxygen_used trekking_agency
0         True             NaN
1        False             NaN
2        False             NaN
3        False             NaN
4        False             NaN
['expedition_id', 'peak_id', 'peak_name', 'year', 'season', 'basecamp_date', 'highpoint_date', 'termination_date', 'termination_reason', 'highpoint_metres', 'members', 'member_deaths', 'hired_staff', 'hired_staff_deaths', 'oxygen_used', 'trekking_agency']
1905
2019

### a) Aggregate the data by decade and count the number of expeditions, the total number of expedition members, and the average rates of death for members and hired staff. Briefly describe what you found.

In [ ]:
expeditions.groupby()

### b) Calculate the length_of_expedition as the time between the basecamp_date and the termination_date in days. Now, standardize these length_of_expedition values to z-values grouped by each peak (that is you need to standardize with the mean and standard deviation of expeditions for the same peak only). Are longer expeditions more or less likely to be associated with death? (no statistical test necessary)

# Question 5: Everest - A trophy?